describe 'ほげ設定' do
  describe 'ほげ一覧を表示する' do
    xit 'ほげ一覧が表示されること' do
      # ほげセレクトボックスを表示
      # ほげを選択
      # ふが画面を表示
    end
    context 'ほげが取得できない場合' do
      xit 'エラー画面を表示すること' do
      end
    end
  end
  describe 'ふがとあれを紐付ける' do
    xit 'ふがにあれを選択し更新すること' do
      # ほげを選択
      # ふがにあれを設定
      # 更新ボタン
      # 更新しました、を確認
      # 別のほげを選択
      # ふがにあれを設定
      # 更新ボタン
      # 更新しました、を確認
      # 前のほげを選択
      # 紐付けたあれが表示されること
    end
    context 'ふがが存在しない場合' do
      xit 'ふがが存在しない旨を表示すること' do
      end
    end
  end
  describe 'ほげの選択状態を保持する' do
    xit '最後に更新したほげの選択状態が保持されること' do
      # ほげを選択
      # 更新ボタン
      # 別のほげを選択
      # 更新ボタン
      # ほげ設定の「詳細設定」を選択
      # 最後に更新したほげが表示されること
    end
  end
end
